test_cases/kOmegaSST_of22/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
2520
(
(0.566219 0 0)
(0.566219 0 0)
(0.566219 0 0)
(0.566219 0 0)
(0.566219 0 0)
(0.566219 0 0)
(0.566219 0 0)
(0.566219 0 0)
...
)
;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
        value           nonuniform List<vector> 
252
(
(0.566219 0 0)
(1.17325 0 0)
(1.54192 0 0)
(1.80841 0 0)
(2.01779 0 0)
(2.19064 0 0)
(2.33809 0 0)
(2.46685 0 0)
...
)
;
    }
    sides_1
    {
        type            empty;
    }
    sides_2
    {
        type            empty;
    }
    inlet
    {
        type            VelocityABL;
        kappa           0.4;
        zDir            ( 0 0 1 );
        flowDir         ( 1 0 0 );
        z0              0.3;
        Uref            6.73;
        Zref            400;
        ustar           0.374087;
        A               -0.04;
        B               0;
        C               0;
        D               0.807;
        E               0;
        BW              0;
        hABL            1;
        blendCoeff      1;
        CmuMax          0.35;
        betaStarMax     0.35;
        WFCmu           0.09;
        WFbetaStar      0.09;
        thresholdU      0.05;
        thresholdK      0.1;
        thresholdE      0.1;
        thresholdO      0.1;
        constantU       1;
        constantK       10;
        constantE       10;
        constantO       10;
        msel            ( 0 0 1 );
        value           nonuniform List<vector> 
252
(
(0.566219 0 0)
(1.17325 0 0)
(1.54192 0 0)
(1.80841 0 0)
(2.01779 0 0)
(2.19064 0 0)
(2.33809 0 0)
(2.46685 0 0)
...
)
;
    }
    ground
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    top
    {
        type            fixedShearStress;
        kappa           0.4;
        zDir            ( 0 0 1 );
        flowDir         ( 1 0 0 );
        z0              0.3;
        Uref            6.73;
        Zref            400;
        ustar           0.374087;
        A               -0.04;
        B               0;
        C               0;
        D               0.807;
        E               0;
        BW              0;
        hABL            1;
        blendCoeff      1;
        CmuMax          0.35;
        betaStarMax     0.35;
        WFCmu           0.09;
        WFbetaStar      0.09;
        thresholdU      0.05;
        thresholdK      0.1;
        thresholdE      0.1;
        thresholdO      0.1;
        constantU       1;
        constantK       10;
        constantE       10;
        constantO       10;
        msel            ( 0 0 1 );
        tau_x           0.139941;
        tau             ( 0.139941 0 0 );
        value           uniform ( 7.37789 0 0 );
    }
}


// ************************************************************************* //
