test_cases/kOmegaSST_of22/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   nonuniform List<scalar> 
2520
(
0.782782
0.782782
0.782782
0.782782
0.782782
0.782782
0.782782
0.782782
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
        value           nonuniform List<scalar> 
252
(
0.782782
0.756819
0.741051
0.729653
0.720697
0.713305
0.706998
0.701491
...
)
;
    }
    sides_1
    {
        type            empty;
    }
    sides_2
    {
        type            empty;
    }
    inlet
    {
        type            kABL;
        kappa           0.4;
        zDir            ( 0 0 1 );
        flowDir         ( 1 0 0 );
        z0              0.3;
        Uref            6.73;
        Zref            400;
        ustar           0.374087;
        A               -0.04;
        B               0;
        C               0;
        D               0.807;
        E               0;
        BW              0;
        hABL            1;
        blendCoeff      1;
        CmuMax          0.35;
        betaStarMax     0.35;
        WFCmu           0.09;
        WFbetaStar      0.09;
        thresholdU      0.05;
        thresholdK      0.1;
        thresholdE      0.1;
        thresholdO      0.1;
        constantU       1;
        constantK       10;
        constantE       10;
        constantO       10;
        msel            ( 0 0 1 );
        value           nonuniform List<scalar> 
252
(
0.782782
0.756819
0.741051
0.729653
0.720697
0.713305
0.706998
0.701491
...
)
;
    }
    ground
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 0.491442;
    }
}


// ************************************************************************* //
