test_cases/kOmegaSST_of22/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
2520
(
0.0822419
0.0822419
0.0822419
0.0822419
0.0822419
0.0822419
0.0822419
0.0822419
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
        value           nonuniform List<scalar> 
252
(
0.0822419
0.157393
0.233447
0.310414
0.388305
0.467131
0.546904
0.627635
...
)
;
    }
    sides_1
    {
        type            empty;
    }
    sides_2
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
252
(
0.0822419
0.157393
0.233447
0.310414
0.388305
0.467131
0.546904
0.627635
...
)
;
    }
    ground
    {
        type            nutRoughABLWallFunction;
        kappa           0.4;
        zDir            uniform ( 0 0 1 );
        flowDir         ( 1 0 0 );
        z0              uniform 0.3;
        Uref            6.73;
        Zref            400;
        ustar           uniform 0.374087;
        A               uniform -0.04;
        B               uniform 0;
        C               uniform 0;
        D               uniform 0.807;
        E               9.793;
        BW              0;
        hABL            1;
        blendCoeff      uniform 1;
        CmuMax          uniform 0.35;
        betaStarMax     uniform 0.35;
        WFCmu           0.09;
        WFbetaStar      uniform 0.09;
        thresholdU      uniform 0.05;
        thresholdK      uniform 0.1;
        thresholdE      uniform 0.1;
        thresholdO      uniform 0.1;
        constantU       uniform 1;
        constantK       uniform 10;
        constantE       uniform 10;
        constantO       uniform 10;
        msel            ( 0 0 1 );
        Etke            uniform 0;
        roughWall       uniform 1;
        kappaWF         uniform 0.4;
        value           uniform 0;
    }
    top
    {
        type            zeroGradient;
        value           uniform 119.753;
    }
}


// ************************************************************************* //
