test_cases/kOmegaSST_of22/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
2520
(
9.51804
9.51804
9.51804
9.51804
9.51804
9.51804
9.51804
9.51804
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
        value           nonuniform List<scalar> 
252
(
9.51804
4.80845
3.17438
2.35058
1.85601
1.52699
1.29273
1.11767
...
)
;
    }
    sides_1
    {
        type            empty;
    }
    sides_2
    {
        type            empty;
    }
    inlet
    {
        type            OmegaABL;
        kappa           0.4;
        zDir            ( 0 0 1 );
        flowDir         ( 1 0 0 );
        z0              0.3;
        Uref            6.73;
        Zref            400;
        ustar           0.374087;
        A               -0.04;
        B               0;
        C               0;
        D               0.807;
        E               0;
        BW              0;
        hABL            1;
        blendCoeff      1;
        CmuMax          0.35;
        betaStarMax     0.35;
        WFCmu           0.09;
        WFbetaStar      0.09;
        thresholdU      0.05;
        thresholdK      0.1;
        thresholdE      0.1;
        thresholdO      0.1;
        constantU       1;
        constantK       10;
        constantE       10;
        constantO       10;
        msel            ( 0 0 1 );
        value           nonuniform List<scalar> 
252
(
9.51804
4.80845
3.17438
2.35058
1.85601
1.52699
1.29273
1.11767
...
)
;
    }
    ground
    {
        type            omegaRoughABL;
        kappa           0.4;
        zDir            uniform ( 0 0 1 );
        flowDir         ( 1 0 0 );
        z0              uniform 0.3;
        Uref            6.73;
        Zref            400;
        ustar           uniform 0.374087;
        A               uniform -0.04;
        B               uniform 0;
        C               uniform 0;
        D               uniform 0.807;
        E               0;
        BW              0;
        hABL            1;
        blendCoeff      uniform 1;
        CmuMax          uniform 0.35;
        betaStarMax     uniform 0.35;
        WFCmu           uniform 0.09;
        WFbetaStar      uniform 0.09;
        thresholdU      uniform 0.05;
        thresholdK      uniform 0.1;
        thresholdE      uniform 0.1;
        thresholdO      uniform 0.1;
        constantU       uniform 1;
        constantK       uniform 10;
        constantE       uniform 10;
        constantO       uniform 10;
        msel            ( 0 0 1 );
        Etke            uniform 0;
        roughWall       uniform 1;
        kappaWF         uniform 0.4;
        value           uniform 1;
    }
    top
    {
        type            zeroGradient;
        value           uniform 0.0041038;
    }
}


// ************************************************************************* //
